In [1]:
import pandas as pd

## 对索引和列名重命名（使用字典）

In [2]:
# 读取示例数据
df1 = pd.read_csv("example1.csv", index_col=0)

In [3]:
df1

   客户_姓名 客户 性别  age                    邮箱
1     李十     女   58  yVaQXekW@example.com
2_    冯三     男   27  LctXbrEM@example.com
3     吴十     男   32  UyTYBzUZ@example.com
4     王十     女   58  KCixgciF@example.com
_5    钱十     女   27  nqRBXOtA@example.com
6*    赵八     女   51  GyKwILAL@example.com

In [4]:
df1.rename(index={"2_":"2", "_5":"5", "6*":"6"})

  客户_姓名 客户 性别  age                    邮箱
1    李十     女   58  yVaQXekW@example.com
2    冯三     男   27  LctXbrEM@example.com
3    吴十     男   32  UyTYBzUZ@example.com
4    王十     女   58  KCixgciF@example.com
5    钱十     女   27  nqRBXOtA@example.com
6    赵八     女   51  GyKwILAL@example.com

In [5]:
df1.rename(columns={"客户_姓名":"客户姓名", "客户 性别":"客户性别", "age":"客户年龄", "邮箱":"客户邮箱"})

   客户姓名 客户性别  客户年龄                  客户邮箱
1    李十    女    58  yVaQXekW@example.com
2_   冯三    男    27  LctXbrEM@example.com
3    吴十    男    32  UyTYBzUZ@example.com
4    王十    女    58  KCixgciF@example.com
_5   钱十    女    27  nqRBXOtA@example.com
6*   赵八    女    51  GyKwILAL@example.com

In [6]:
# 原始 DataFrame 没有被改变
df1

   客户_姓名 客户 性别  age                    邮箱
1     李十     女   58  yVaQXekW@example.com
2_    冯三     男   27  LctXbrEM@example.com
3     吴十     男   32  UyTYBzUZ@example.com
4     王十     女   58  KCixgciF@example.com
_5    钱十     女   27  nqRBXOtA@example.com
6*    赵八     女   51  GyKwILAL@example.com

In [7]:
df1 = df1.rename(index={"2_":"2", "_5":"5", "6*":"6"})
# df1变成重命名后的
df1

  客户_姓名 客户 性别  age                    邮箱
1    李十     女   58  yVaQXekW@example.com
2    冯三     男   27  LctXbrEM@example.com
3    吴十     男   32  UyTYBzUZ@example.com
4    王十     女   58  KCixgciF@example.com
5    钱十     女   27  nqRBXOtA@example.com
6    赵八     女   51  GyKwILAL@example.com

In [8]:
df1.rename(columns={"客户_姓名":"客户姓名", "客户 性别":"客户性别", 
                    "age":"客户年龄", "邮箱":"客户邮箱"}, inplace=True)
# df1变成重命名后的
df1

  客户姓名 客户性别  客户年龄                  客户邮箱
1   李十    女    58  yVaQXekW@example.com
2   冯三    男    27  LctXbrEM@example.com
3   吴十    男    32  UyTYBzUZ@example.com
4   王十    女    58  KCixgciF@example.com
5   钱十    女    27  nqRBXOtA@example.com
6   赵八    女    51  GyKwILAL@example.com

## 对索引和列名重命名（使用方法/函数）

In [9]:
s1 = pd.Series(["hello", "this", "is", "Lin"])
s1

0    hello
1     this
2       is
3      Lin
dtype: object

In [10]:
s1

0    hello
1     this
2       is
3      Lin
dtype: object

In [11]:
s1.str

In [12]:
s1.str.upper()

0    HELLO
1     THIS
2       IS
3      LIN
dtype: object

In [13]:
# 展示 str.upper 方法的用法
s1.str.upper()

0    HELLO
1     THIS
2       IS
3      LIN
dtype: object

In [14]:
# 读取示例数据
df2 = pd.read_csv("example2.csv")
df2

         Date  Amount Salesperson       Location
0  2022-01-01    1000       Alice       New York
1  2022-01-02    1500         Bob  San Francisco
2  2022-01-03     800     Charlie       New York
3  2022-01-04    1200       David  San Francisco

In [15]:
df2.rename(columns=str.upper)

         DATE  AMOUNT SALESPERSON       LOCATION
0  2022-01-01    1000       Alice       New York
1  2022-01-02    1500         Bob  San Francisco
2  2022-01-03     800     Charlie       New York
3  2022-01-04    1200       David  San Francisco

## 把某列设为索引

In [16]:
df2

         Date  Amount Salesperson       Location
0  2022-01-01    1000       Alice       New York
1  2022-01-02    1500         Bob  San Francisco
2  2022-01-03     800     Charlie       New York
3  2022-01-04    1200       David  San Francisco

In [17]:
df3 = df2.set_index("Salesperson")
df3

                   Date  Amount       Location
Salesperson
Alice        2022-01-01    1000       New York
Bob          2022-01-02    1500  San Francisco
Charlie      2022-01-03     800       New York
David        2022-01-04    1200  San Francisco

## 重设索引

In [18]:
df3.reset_index()

  Salesperson        Date  Amount       Location
0       Alice  2022-01-01    1000       New York
1         Bob  2022-01-02    1500  San Francisco
2     Charlie  2022-01-03     800       New York
3       David  2022-01-04    1200  San Francisco

## 对索引和列名重新排序

In [19]:
# 读取示例数据
df4 = pd.read_csv("example3.csv", index_col=0)

In [20]:
df4

  客户姓名 客户性别  客户年龄                  客户邮箱
a   李十    女    58  yVaQXekW@example.com
c   冯三    男    27  LctXbrEM@example.com
b   吴十    男    32  UyTYBzUZ@example.com
e   王十    女    58  KCixgciF@example.com
d   钱十    女    27  nqRBXOtA@example.com
f   赵八    女    51  GyKwILAL@example.com

In [21]:
df4.sort_index()

  客户姓名 客户性别  客户年龄                  客户邮箱
a   李十    女    58  yVaQXekW@example.com
b   吴十    男    32  UyTYBzUZ@example.com
c   冯三    男    27  LctXbrEM@example.com
d   钱十    女    27  nqRBXOtA@example.com
e   王十    女    58  KCixgciF@example.com
f   赵八    女    51  GyKwILAL@example.com